<x-headingNormal title="আমাদের স্বকীয়তা"/>

<div class="max-w-6xl mx-auto px-4 grid grid-cols-1 md:grid-cols-3 mb-5 gap-5">
    <!-- Box 1 -->
   <x-individualCard
        title="শরীয়া ভিওির্ক বিবাহ কার্যক্রম"
        text="শরীয়াহ মোতাবেক পরিচালিত আমাদের বিবাহ কার্যক্রমে ইসলামী আদর্শ ও নীতিমালা পুরোপুরিভাবে অনুসরণ করা হয়।"
    />

    <x-individualCard
        title="দ্রুত প্রসেসিং"
        text="সকল তথ্য যাচাই করে অল্প সময়ের মধ্যে ম্যাচিং ও যোগাযোগের ব্যবস্থা করা হয়।"
    />

    <x-individualCard
        title="তথ্যগত নিরাপদ"
        text="সুখী দাম্পত্য জীবনের জন্য প্রয়োজন সচেতনতা ও পারস্পরিক বোঝাপড়া। আমরা দিচ্ছি শরীয়াহসম্মত পরামর্শ।"
    />

</div>