<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
</head>

<body>

    @extends('layout.app')


    @section('content')
        <x-PageHero title="আমাদের সম্পর্কেঃ" />
        <!-- About content start -->
        <div class="max-w-6xl mx-auto px-4 pt-10 md:py-10">
            <p class="text-center text-xl">بسم اللهِ الرَّحْمَنِ الرَّحِيمِ*</p>
            <p class="text-justify text-slate-600 py-3">রাসূলে আকরাম (সা.) এমন সমাজ প্রতিষ্ঠা করেছিলেন যেখানে
                নেক আমল করা ছিল সহজ, গোনাহ করা ছিল কঠিন। বিবাহ এমন একটি গুরুত্বপূর্ণ ইবাদাত ও সুন্নাহ যার মাধ্যমে একজন
                মুসলিমের অর্ধেক ঈমান পূর্ণ হয়। বাকি অর্ধেকের ব্যাপারে আল্লাহকে ভয় করতে বলা হয়েছে। হাদীসের পাতা থেকে জানতে
                পারি, সাহাবায়ে কেরামের সময়ে নিকাহ তথা বিবাহ ছিল সহজ, যিনা-ব্যভিচার ছিল অত্যন্ত কঠিন। সময়ের পরিক্রমায় এ যেন
                উল্টে গেছে। একদিকে সভ্যতার উন্নয়নের বুলিতে জগৎ আচ্ছন্ন, অন্যদিকে মানবীয় বিষয়গুলো গুরুত্ব হারাচ্ছে। পড়াশুনা,
                ক্যারিয়ার, সামাজিক অবস্থান তৈরি ইত্যাদির দিকে মনোযোগ দিতে যুবক-যুবতীর সেরা সময়টুকু সঙ্গীহীন কাটাতে হয়।
                একদিকে বয়স বেড়ে যায়, রোগশোক চেপে বসে, স্বাস্থ্যের অবনতি ঘটে, অন্যদিকে গোনাহের ধুম্রজাল বিছানো নগরীতে পদে পদে
                পঙ্কিলতার হাতছানি মানসিক অবক্ষয় ডেকে আনে। আরেকটি উল্লেখ করবার মত বিষয় হল-বাড়তি বয়সের মেয়েদের বিয়ে দেওয়ার
                ক্ষেত্রে বাবা-মায়ের পেরেশানি আর গোপন আর্ত-চিৎকারে আকাশ-বাতাস ভারী হয়ে যায়।</p>

            <p class="text-justify text-slate-600 py-3">দাওয়াতুল হক একাডেমির ম্যারেজ মিডিয়া- "মুমিন জুটি"
                প্রতিষ্ঠার অন্যতম উদ্দেশ্য হলো বিবাহ ব্যবস্থাকে সহজ করা, অসহায় পরিবারের মেয়েদের বিবাহের দায়িত্ব নেওয়া। এজন্য
                এখানে রেজিস্ট্রেশন ফি রাখা হয়েছে সামর্থ্যানুযায়ী। আর যার সামর্থ্য নেই আমরা খেদমতের নিয়তে তার মধ্যস্ততা করব
                ইনশাআল্লাহ।</p>
        </div>
        <!-- About content end -->

        <!-- Individuality story start-->
        <x-IndividualityStory />
        <!-- Individuality story end-->


        <!-- Success story start-->
        <div class="max-w-6xl mx-auto px-4 my-10">
            <x-headingNormal title="সফলতার গল্প" />

            <div class="flex flex-col gap-5">
                <x-IndividualSuccess title="সফল বিবাহ" text="বিশ্বাস, বোঝাপড়া ও দ্বীনদার জীবনের মাধ্যমে গড়ে উঠে
                সফল দাম্পত্য জীবন।
                আমাদের মাধ্যমে ইতোমধ্যে বহু সফল বিবাহ সম্পন্ন হয়েছে শরীয়াহসম্মত উপায়ে।" />
                <x-IndividualSuccess title="সফল বিবাহ" text="বিশ্বাস, বোঝাপড়া ও দ্বীনদার জীবনের মাধ্যমে গড়ে উঠে
                সফল দাম্পত্য জীবন।
                আমাদের মাধ্যমে ইতোমধ্যে বহু সফল বিবাহ সম্পন্ন হয়েছে শরীয়াহসম্মত উপায়ে।" />
            </div>
        </div>
        <!-- Success story end-->

    @endsection

</body>

</html>