@php
$blogs = [
    [
        'image' => '/img/blog.jpg',
        'category' => 'কুরআন',
        'title' => 'বাক্কা নামের রহস্য',
        'excerpt' => '– আবদুল্লাহ আল মাসউদ মক্কা শহরের নাম শুনেনি, এমন মানুষ খুঁজে পাওয়া যাবে না। কিন্তু এই শহরের অপর একটি নাম',
        'link' => '/blogDetails',
    ],
    [
        'image' => '/img/blog.jpg',
        'category' => 'কুরআন',
        'title' => 'বাক্কা নামের রহস্য',
        'excerpt' => '– আবদুল্লাহ আল মাসউদ মক্কা শহরের নাম শুনেনি, এমন মানুষ খুঁজে পাওয়া যাবে না। কিন্তু এই শহরের অপর একটি নাম',
        'link' => '/blogDetails',
    ],
    [
        'image' => '/img/blog.jpg',
        'category' => 'কুরআন',
        'title' => 'বাক্কা নামের রহস্য',
        'excerpt' => '– আবদুল্লাহ আল মাসউদ মক্কা শহরের নাম শুনেনি, এমন মানুষ খুঁজে পাওয়া যাবে না। কিন্তু এই শহরের অপর একটি নাম',
        'link' => '/blogDetails',
    ],
    
];
@endphp

<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
</head>

<body>

    @extends('layout.app')


    @section('content')

        <div class="mt-16 md:mt-0">
            <div>
                <img src="/img/blog-details.jpg" alt="">
            </div>
        </div>
        <!-- blog details start -->
        <div class="max-w-6xl mx-auto px-4">
            <h2 class=" py-4 md:py-8 text-center text-gray-700 text-2xl md:text-4xl">বাক্কা নামের রহস্য</h2>
            <p class="text-slate-600 text-justify">শুরু করার আগে

                আল্লাহর দেওয়া তাওফীকে আলহামদুলিল্লাহ আমার হিফজের সবক শেষ হয়েছে। আল্লাহর অনেক শুকরিয়া আদায় করছি। পরিচিত
                অনেক
                আপুদের খুব ইচ্ছা ছিল আমার হিফজ-জার্নি শুনবেন। যেদিন তারা আমাকে ধরে বসলেন, সেদিন তাদেরকে বললাম, এই বরকতময়
                বিষয়টা
                নিয়ে আমি লিখবো ইনশাআল্লাহ। পরবর্তীতে ছোট করে একটি অনুভূতি লিখি। বিস্তারিত লেখার সাহস হচ্ছিল না যে, এতো
                মুবারক
                সফরে যা কিছু পেয়েছি সব তো আল্লাহই তার আপন দয়ায় দিয়েছেন। এগুলো ব্যক্ত করার মতো অনুভবশক্তিও আমার নেই; নেই
                বলার
                মতো আদবও। শুরুতেই ছোট করে লিখেছিলাম। লেখাটি দেখে আমার উস্তায আবদুল্লাহ আল মাসউদ সাহেব আরও সুন্দর করে কিছুটা
                বিস্তারিত আকারে লিখতে বললেন। তাঁর কথার কারণেই বর্তমান লেখাটা লিখতে বসি। বাস্তবতা হলো হিফজের পথের এই লম্বা
                জার্নি
                বলে কিংবা লিখে সবটুকু প্রকাশ করার মত যোগ্যতা আমার নেই, পাঠক সেটা মাথায় রাখবেন। অসংখ্য অগণিত গোনাহের বোঝা
                কাঁধে
                নিয়ে কুরআন হিফজের যোগ্যতা যে আল্লাহ আমাকে দিয়েছেন, সেটাই তো অনেক। আল্লাহর কাছে পানাহ চাই, তিনি যেন তাঁর
                বান্দার
                প্রতি অসন্তুষ্ট না হোন। আমার লেখার একমাত্র উদ্দেশ্য অন্যদেরকে হিফজের প্রতি আগ্রহী করা।

                হিফজের প্রতি যেভাবে আগ্রহ জন্মাল

                আল্লাহর কালাম হিফজ করার ইচ্ছাটা যেভাবে আমার মনের মধ্যে শেকড় গেড়েছিল সেই গল্পটা বলতে গেলে জীবনের শুরুর দিকে
                যেতে
                হবে। কুরআনের সাথে আমার পথচলার শুরুটা হয় আম্মুর হাত ধরে। ছোটবেলায় মাগরিবের পর আম্মুর সাথে কুরআন পড়তাম,
                এভাবেই
                একবারে ছোট বয়সে ঘরে বসে সূরা যিলযাল পর্যন্ত মুখস্থ করেছিলাম আলহামদুলিল্লাহ। এরপর শুরু হয়েছিল মক্তব-যাত্রা।
                ছোটদের মক্তবের সে ধারা আজ বিলুপ্তির পথে। সাথে আমাদের ছোটরা বঞ্চিত ভোরের বারাকাহ থেকেও। মক্তবে কুরআনে কারীম
                কয়েকবার পড়ে খতম করার পর হুজুর কিছু আমলী সূরা মুখস্থ করিয়েছিলেন। এতটুকু মুখস্থ দিয়েই চলছিল আমার জীবন।
                তারপর
                নিজের অন্যান্য পড়াশোনায় মশগুল হয়ে যাই। ফলে হিফজের দিকে আর তেমন মনোযোগ দিতে পারিনি। বাসায় ইসলামের ইতিহাস,
                সাহাবাদের জীবনী পড়তাম। সাহাবায়ে কেরামের (রিদ্বওয়ানুল্লাহি আজমাঈন) জীবনীতে কিয়ামুল লাইলে পূর্ণ কুরআনুল
                কারীম
                খতম, সূরা বাকারা খতম করা দেখে অবাক হতাম। কিছু একটা ভেতরে ভেতরে গুমরে মরতো। কিন্তু সেটা কী তা পুরোপুরি ধরতে
                পারতাম
                না। আসলে আল্লাহ তৌফিক দিলে আমিও পূর্ণ কুরআনের হাফেজা হতে পারব- এই ভাবনাটা হৃদয়পটে কখনো উদিত হয়নি।

                ইসলামিক বিভিন্ন কিতাব পাঠ মানুষের জীবনে অনেক কিছু এনে দেয়; এমনকি জীবনের মোড় পর্যন্ত সম্পূর্ণ ভিন্ন পথে
                বদলে দেয়
                কখনও কখনও। পড়াশোনার ফাঁকে ফাঁকে তাই অনেক বই পড়তাম আলহামদুলিল্লাহ। হিফজের স্বপ্ন প্রথম আমার দিলে একটু আসন
                গাড়লো
                একটি বইয়ের পাঠ-পরবর্তী প্রতিক্রিয়া থেকে। বইটির নাম ছিল ‘আমার আম্মা’। লেখক আবুল হাসান আলী নদভী
                (রাহিমাহুল্লাহু)।
                এই বইতে তিনি তাঁর সম্মানিত আম্মার জীবনের কিছু কথা পাঠকের সামনে তুলে ধরেছিলেন। তাঁর আম্মার হিফজের জার্নিটা
                আমাকে
                উদ্বুদ্ধ করেছিল। তিনি ছিলেন তাঁর বংশে সর্ব প্রথম কুরআনের হাফেজা। মোটামুটি একটা বাঁধা পেরিয়ে তিনি এই
                স্বপ্নের
                পূর্ণতা পেয়েছিলেন এবং তাঁর থেকে অনুপ্রাণিত হয়ে আরও অনেকে হিফজের যাত্রা শুরু করেছিল। তখন আমারও ইচ্ছে হলো
                অবসর
                সময় কুরআন হিফজের পেছনে ব্যয় করতে। আব্বু-আম্মু মনে করতেন মেয়েদের জন্য হিফজ তো কঠিন যাত্রা, তাই তাদের তেমন
                আশা বা
                ইচ্ছা ছিলো না।

                আমি নিজ আগ্রহে হিফজ করা শুরু করি। ঘরে বসে এক পারা মুখস্ত করেছিলাম। এরপর একটা সময় হিফজ করা থেমে গিয়েছিল।
                ভেতরে
                ভেতরে হাফেজা হওয়ার স্বপ্নটা তখন জ্বলে আর নিভে। পরবর্তীতে যখন শাইখুল হাদীস যাকারিয়া রাহিমাহুল্লাহ এর
                আত্নজীবনী
                ‘আপবীতী’ পড়তাম, তাঁর খান্দানের নারীদের হিফজের আলোচনাগুলো আমাকে অনেক উদ্বুদ্ধ করতো। ভেতরে একটা তড়প নিয়ে
                আগামীর
                স্বপ্ন দেখতাম। ভাবতাম, তাঁরা এবং আবুল হাসান আলী নাদবী রাহ এর আম্মাজান মুহতারামা খাইরুন্নেসা (রাহিমাহাল্লাহ)
                এর
                জীবন তো নিকট অতীতে। আর আল্লাহ চাইলে বিষয়টা অসম্ভব কিছুও না।

                এরপর দ্বিতীয় বার আবার হিফজ করার প্রতি আমার প্রবল ইচ্ছা জাগ্রত হয়েছিলো মসজিদে নববীতে কুরআনের হালাকায় ছোট
                ছোট
                বাচ্চাদের নিমগ্নতা দেখে। যে ক’দিন আল্লাহ মদীনার বাতাসে শ্বাস নেবার তাওফীক দিয়েছিলেন খুঁজে খুঁজে তাদের
                আশেপাশে বসে
                থাকতাম। নিজের ইচ্ছার পরও যা এখনও আমার তাওফীকে আসেনি তা অন্যের মাঝে দেখার মধ্যে এক ধরণের বেদনামিশ্রিত অনুভূতি
                আছে,
                যা অন্তরের সুপ্ত ইচ্ছাটাকে জিইয়ে রাখে। মসজিদে নববীর সুবিশাল শামিয়ানার নিচে বসে তাঁদের দিকে নিরবে চেয়ে
                থাকতাম ।
                নিজেকে শুণ্য মনে হতো।

                সে বছরই অনলাইনে এসেছিলাম অবসর সময়ে আরবীর দুর্বলতাগুলো কাটিয়ে নিতে। এখানে এসে সাওদা নামে এক আপুকে পাই। তিনি
                কুরআনে কারীমের হাফেজা এটা বুঝতে পেরেছিলাম। ভার্সিটিতে পড়েও পরবর্তীতে তিনি হাফেজা হয়েছেন। আপুর হিফজের গল্প
                শুনে
                আম্মু-আব্বুকে জোর করে ধরলাম যে, জেনারেল লাইন থেকে এসে বড় হয়ে হিফজের তাওফীক আল্লাহ দিয়েছেন, এমন উদাহরণ তো
                আছে।
                আল্লাহ চাইলে যাকে ইচ্ছা যখন ইচ্ছা দেন, শুধু চাইতে হয় কাতর হয়ে শূণ্য হাত দুখানি পেতে। এরপর কুড়িয়ে নিতে
                হয় নত
                মস্তকে সমর্পিত হৃদয়ে। অনেক মিনতির পরে আব্বু-আম্মু পাঁচ পারা হিফজের জন্য অনুমতি দিয়েছিলেন। একটি একাডেমিতে
                পাঁচ
                পারা হিফজের কোর্স ছিল। পরে কোন এক কারণে সেখানে হয়নি দেখে সাওদা আপু পার্সোনালি একজন উস্তাযার খবর দিয়েছিলেন।
                এটা
                আমার জন্য খাইরই ছিল আলহামদুলিল্লাহ। নয়ত এই পাঁচেই হয়তো সীমাবদ্ধ হয়ে যেতাম আমি। সমস্ত প্রশংসা আল্লাহরই।



            </p>

            {{-- share button --}}
            <div class="flex justify-between items-center md:flex-row flex-col py-5">
                <div>
                    <h2 class=" py-4 md:py-8  text-gray-700 text-2xl md:text-4xl">Shear:</h2>
                </div>
                <div>
                    <x-social-share title="বাক্কা নামের রহস্য" />
                </div>
            </div>
        </div>

        <div class="border-t-2 border-teal-500">
            <div class="max-w-6xl mx-auto px-4 py-10">
                <h2 class="py-4 md:py-8  text-teal-800 text-2xl md:text-4xl">জনপ্রিয় ব্লগ</h2>
                <div class="grid grid-cols-1 md:grid-cols-3 sm:grid-cols-2 gap-10">
 @foreach($blogs as $blog)
                <x-BlogCard 
                    :image="$blog['image']"
                    :category="$blog['category']"
                    :title="$blog['title']"
                    :excerpt="$blog['excerpt']"
                    :link="$blog['link']"
                />
            @endforeach
                </div>
            </div>
        </div>


    @endsection

</body>

</html>