@extends('layout.app')

@php
$faqs = [
    [
        'question' => 'Momin joti তে বায়োডাটা তৈরি করতে কেমন খরচ হবে?',
        'answer' => 'Momin joti বায়োডাটা তৈরি করার জন্য কোন চার্জ নেয় না।',
    ],
    [
        'question' => 'আমি কি এখানে বায়োডাটা তৈরি করতে পারব?',
        'answer' => 'আপনি যদি একজন দ্বীনদার ভাই বা বোন হয়ে থাকেন তাহলে আপনি এখানে বায়োডাটা তৈরি করতে পারবেন। দ্বীনদার অর্থাৎ ৫ ওয়াক্ত নামাযী। ভাইদের জন্য সুন্নাতি দাড়ি, টাখনুর উপরে কাপড় পড়া এবং হারাম ইনকামের সাথে জড়িত না থাকা। বোনদের জন্য নিকাবসহ পর্দা করা।',
    ],
    [
        'question' => 'কোন বায়োডাটা পছন্দ হলে কি করতে হবে?',
        'answer' => 'আপনার যদি কোন বায়োডাটা পছন্দ হয় তাহলে আপনি যোগাযোগ বাটনে ক্লিক করবেন। এরপর পেমেন্ট করে অভিভাবকের নাম্বারের জন্য রিকুয়েস্ট করবেন। সাধারণত ২৪ ঘন্টার মধ্যে আমরা ইনফো দেওয়ার চেষ্টা করি।',
    ],
    [
        'question' => 'আমার এখনো কোন ইনকাম নেই। তবে আমার বাসায় আমার বিয়েতে রাজি। আমি বায়োডাটা তৈরি করতে পারব?',
        'answer' => 'জ্বি ইন শা আল্লাহ্‌। আপনি বায়োডাটা তৈরি করে ফেলুন।',
    ],
    [
        'question' => 'বায়োডাটা ডিলেট করবো কিভাবে?',
        'answer' => 'উপরে ডান দিক থেকে "আমার বায়োডাটা"> সেটিংস> একাউন্ট ডিলিট>হাইড/তথ্য ডিলিট হাইড করলে পরবর্তীতে চাইলে আবার বায়ো পাবলিকলি শো করতে পারবেন। ডিলিট হলে এটা পারমানেন্টভাবে ডিলিট হয়ে যাবে।',
    ],
    [
        'question' => 'কোন বায়োডাটায় কেউ মিথ্যা তথ্য দিয়েছে কিনা কিভাবে বুঝবো?',
        'answer' => 'আমরা আশা করি সবাই আল্লাহ্‌কে ভয় করে সত্য তথ্যটাই দিবে। সব মিথ্যা তথ্য বোঝা সম্ভব নয়, তবে যথাসম্ভব খোঁজখবর নেওয়া উচিত।',
    ],
];

@endphp

@section('content')

    <x-PageHero title="সচরাচর জিজ্ঞাসা:" />

    <x-faqSection :faqs="$faqs" />

@endsection

@push('scripts')
    <script src="{{ asset('js/faq.js') }}"></script>
@endpush
