@extends('layout.app')

@php
$faqs = [
    [
        'question' => 'Momin joti তে বায়োডাটা তৈরি করতে কেমন খরচ হবে?',
        'answer' => 'Momin joti বায়োডাটা তৈরি করার জন্য কোন চার্জ নেয় না।',
    ],
    [
        'question' => 'আমি কি এখানে বায়োডাটা তৈরি করতে পারব?',
        'answer' => 'আপনি যদি একজন দ্বীনদার ভাই বা বোন হয়ে থাকেন তাহলে আপনি এখানে বায়োডাটা তৈরি করতে পারবেন।',
    ],
    [
        'question' => 'কোন বায়োডাটা পছন্দ হলে কি করতে হবে?',
        'answer' => 'যোগাযোগ বাটনে ক্লিক করে পেমেন্ট করে অভিভাবকের নাম্বারের জন্য রিকুয়েস্ট করবেন।',
    ],
    [
        'question' => 'আমার এখনো কোন ইনকাম নেই। আমি বায়োডাটা তৈরি করতে পারব?',
        'answer' => 'জ্বি ইন শা আল্লাহ্‌, আপনি বায়োডাটা তৈরি করতে পারবেন।',
    ],
];
@endphp

@section('content')

    <x-PageHero title="সচরাচর জিজ্ঞাসা:" />

    <x-faqSection :faqs="$faqs" />

@endsection

@push('scripts')
    <script src="{{ asset('js/faq.js') }}"></script>
@endpush
