<div x-show="step === 10" class="space-y-6 max-w-xl">

    {{-- পাত্রের নাম --}}
    <x-form.input
        label="পাত্রের নাম"
        required
        hint="পূর্ণ নাম লিখুন"
    />

    {{-- অভিভাবকের মোবাইল নাম্বার --}}
    <x-form.input
        label="অভিভাবকের মোবাইল নাম্বার"
        required
        placeholder="01700-000000"
        hint="কেউ আপনার অভিভাবকের সাথে যোগাযোগ করতে চাইলে এই নাম্বারটি দেয়া হবে।
        এই নাম্বারে কল দিয়ে ভেরিফাই করার পর বায়োডাটা এপ্রুভ করা হবে।
        এখানে বন্ধু, কলিগ, কাজিন বা পাত্র/পাত্রীর নিজের নাম্বার লিখলে বায়োডাটা স্থায়ীভাবে ব্যান করা হবে।"
    />

    {{-- অভিভাবকের সাথে সম্পর্ক --}}
    <x-form.input
        label="অভিভাবকের সাথে সম্পর্ক"
        required
        hint="উক্ত অভিভাবক আপনার সম্পর্কে কি হয় তা লিখুন। যেমনঃ বাবা।"
    />

    {{-- ই-মেইল --}}
    <x-form.input
        type="email"
        label="বায়োডাটা গ্রহণের ই-মেইল"
        required
        placeholder="your-email@gmail.com"
        hint="অনাকাঙ্ক্ষিত ঘটনা এড়াতে, সম্ভব হলে অভিভাবকের ই-মেইল এড্রেস লিখুন।"
    />

</div>
